# Cleaning Data Exercise
Course material from maven analytics

In [1]:
import pandas as pd

In [3]:
run_times = pd.read_excel('data/Run Times.xlsx')

In [4]:
run_times.head()

,Name,Run Time,Warm Up Time,Location,Run Date,Race Date,Rain,Fee
0,Alexis,9.2343,3.5,“school”,2023-04-15 12:00:00,2023-06-01,False,$0.00
1,Alexis,10.3842,3.5,School,2023-04-22 12:30:00,2023-06-01,True,$0.00
2,Alexis,8.1209,3 min,“the gym”,2023-05-10 15:00:00,2023-06-01,False,$2.50
3,David,7.2123,2.2,“school”,2023-05-01 15:15:00,2023-06-15,False,$0.00
4,David,6.8342,2,“gym”,2023-05-10 16:30:00,2023-06-15,False,$2.50

In [5]:
run_times.dtypes

Name                    object
Run Time               float64
Warm Up Time            object
Location                object
Run Date        datetime64[ns]
Race Date       datetime64[ns]
Rain                      bool
Fee                     object
dtype: object

After initial inspection of the data and the data types.  We're going to focus on the fee column, the 'warm up time' column, and possibly the Rain column as well.

In [8]:
run_times['Fee'] = pd.to_numeric(run_times['Fee'].str.replace('$', ''))

In [9]:
run_times.dtypes

Name                    object
Run Time               float64
Warm Up Time            object
Location                object
Run Date        datetime64[ns]
Race Date       datetime64[ns]
Rain                      bool
Fee                    float64
dtype: object

Apparently you can also use:  
`run_times.Fee`

Now we clean up the 'Warm Up Time' column   
`run_times['Warm Up Time'].str.replace(' min', '')`  

This changed the fields that didn't have min to NaN.  This is unexpected, and not what we want.

In [17]:
run_times['Warm Up Time'] = run_times['Warm Up Time'].astype(str).str.replace(' min', '')
run_times['Warm Up Time']

0    3.5
1    3.5
2      3
3    2.2
4      2
Name: Warm Up Time, dtype: object

In [20]:
# Now we convert to numeric
run_times['Warm Up Time'] = pd.to_numeric(run_times['Warm Up Time'])
run_times.dtypes

Name                    object
Run Time               float64
Warm Up Time           float64
Location                object
Run Date        datetime64[ns]
Race Date       datetime64[ns]
Rain                      bool
Fee                    float64
dtype: object

Some people may want to change the boolean type columns to 1s and 0s, so if you wish:
`run_times.Rain.astype('int')`

## Missing Data

In [26]:
grades = pd.read_excel('data/Student Grades.xlsx')
grades

    Student             Class      Year  Grade
0      Emma  Freshman Seminar  Freshman   86.0
1    Olivia  Freshman Seminar  Freshman   86.0
2      Noah  Freshman Seminar  Freshman   86.0
3    Sophia  Freshman Seminar  Freshman   87.0
4      Liam  Freshman Seminar  Freshman   90.0
..      ...               ...       ...    ...
81      NaN               NaN       NaN    NaN
82  Bennett               NaN       NaN    NaN
83      NaN               EDA    Junior   84.0
84    Gavin               EDA    Senior    NaN
85   Calvin               NaN       NaN  100.0

[86 rows x 4 columns]

In [27]:
grades.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86 entries, 0 to 85
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  84 non-null     object
 1   Class    83 non-null     object
 2   Year     80 non-null     object
 3   Grade    82 non-null     float64
dtypes: float64(1), object(3)
memory usage: 2.8+ KB

In [25]:
grades.isna().sum()

Student    2
Class      3
Year       6
Grade      4
dtype: int64

In [29]:
grades.Year.value_counts(dropna=False)

Year
Freshman     35
Sophomore    24
Junior       20
NaN           6
Senior        1
Name: count, dtype: int64

In [31]:
grades.isna().any(axis=1)

0     False
1     False
2     False
3     False
4     False
      ...
81     True
82     True
83     True
84     True
85     True
Length: 86, dtype: bool

In [ ]:
# Show all values that have missing values
df[df.isna().any(axis=1)]